accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/customers/GetCustomerAndContracts-ResponseXml.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/AccountManagement/GetCustomerAndContracts">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetCustomerAndContractsResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Optional:-->
               <get:CustomerList>
                  <!--Zero or more repetitions:-->
                  <get:Customer>
                     <get:CustomerID>?</get:CustomerID>
                     <get:Uid>?</get:Uid>
                     <get:GivenName>?</get:GivenName>
                     <get:ObjectClass>?</get:ObjectClass>
                     <get:BillPreferredLanguage>?</get:BillPreferredLanguage>
                     <get:IvrPin>?</get:IvrPin>
                     <get:VIPFlag>?</get:VIPFlag>
                     <get:PaymentResponsible>?</get:PaymentResponsible>
                     <get:CustomerCode>?</get:CustomerCode>
                     <get:BirthDate>?</get:BirthDate>
                     <get:CustomerType>?</get:CustomerType>
                     <get:ParentAccount>?</get:ParentAccount>
                     <get:SmeAdministratorFlag>?</get:SmeAdministratorFlag>
                     <get:Sponsor>?</get:Sponsor>
                     <get:ContractResponsible>?</get:ContractResponsible>
                     <get:DuDirectMarketing>?</get:DuDirectMarketing>
                     <get:WifiContract>?</get:WifiContract>
                     <get:PrgCode>?</get:PrgCode>
                     <get:PreferredLanguage>?</get:PreferredLanguage>
                     <get:Description>?</get:Description>
                     <get:L>?</get:L>
                     <!--Optional:-->
                     <get:ContractsList>
                        <!--Zero or more repetitions:-->
                        <get:Contracts>
                           <get:CustomerID>?</get:CustomerID>
                           <get:Roid>?</get:Roid>
                           <get:Uid>?</get:Uid>
                           <get:GivenName>?</get:GivenName>
                           <get:ObjectClass>?</get:ObjectClass>
                           <get:ContractCode>?</get:ContractCode>
                           <get:RangeHighValue>?</get:RangeHighValue>
                           <get:RangeLowValue>?</get:RangeLowValue>
                           <get:ServiceCode>?</get:ServiceCode>
                           <get:ServiceID>?</get:ServiceID>
                           <get:ServiceStatus>?</get:ServiceStatus>
                           <get:ServiceStatusDate>?</get:ServiceStatusDate>
                           <get:ServiceDirNum>?</get:ServiceDirNum>
                           <!--Optional:-->
                           <get:ServiceParameters>?</get:ServiceParameters>
                           <get:MigrationFlag>?</get:MigrationFlag>
                           <get:FamilyOwnerContractCode>?</get:FamilyOwnerContractCode>
                           <get:LineUserduDirectMarketing>?</get:LineUserduDirectMarketing>
                           <get:RatePlan>?</get:RatePlan>
                           <get:MainServiceNumber>?</get:MainServiceNumber>
                           <get:LineUserFirstName>?</get:LineUserFirstName>
                           <get:ChargingPlatformValue>?</get:ChargingPlatformValue>
                           <get:LineUserServiceLanguage>?</get:LineUserServiceLanguage>
                           <get:HighRange>?</get:HighRange>
                           <get:ContractType>?</get:ContractType>
                           <get:RatePlanPub>?</get:RatePlanPub>
                           <get:LineUserCanUpdateAccount>?</get:LineUserCanUpdateAccount>
                           <get:GisLocationID>?</get:GisLocationID>
                           <get:FamilyMember>?</get:FamilyMember>
                           <get:FamilyCode>?</get:FamilyCode>
                           <get:AuthorisedPerson>?</get:AuthorisedPerson>
                           <get:MainContract>?</get:MainContract>
                           <get:ServiceInstanceID>?</get:ServiceInstanceID>
                           <get:ContractStatus>?</get:ContractStatus>
                           <!--Optional:-->
                           <get:ContractLastReason>?</get:ContractLastReason>
                           <get:LineUserFamilyName>?</get:LineUserFamilyName>
                           <get:LineUserVIPFlag>?</get:LineUserVIPFlag>
                           <get:ServiceNumber>?</get:ServiceNumber>
                           <get:LineUserDirectMarketing>?</get:LineUserDirectMarketing>
                           <!--Optional:-->
                           <get:ServiceList>?</get:ServiceList>
                           <get:Market>?</get:Market>
                           <get:CustomerValue>?</get:CustomerValue>
                           <get:LineUserNumericPassword>?</get:LineUserNumericPassword>
                           <get:LineUserEmailAddress>?</get:LineUserEmailAddress>
                           <get:LineUserMiddleName1>?</get:LineUserMiddleName1>
                           <get:LineUserMiddleName2>?</get:LineUserMiddleName2>
                           <get:SubMarket>?</get:SubMarket>
                           <get:LineUserTitle>?</get:LineUserTitle>
                           <get:LowRange>?</get:LowRange>
                           <get:Budget>?</get:Budget>
                           <get:BillPreferredLanguage>?</get:BillPreferredLanguage>
                           <get:AccountId>?</get:AccountId>
                           <get:IvrPin>?</get:IvrPin>
                           <get:BbAdminFlag>?</get:BbAdminFlag>
                           <get:VIPFlag>?</get:VIPFlag>
                           <get:PaymentResponsible>?</get:PaymentResponsible>
                           <get:InformationToReceive>?</get:InformationToReceive>
                           <get:CustomerCode>?</get:CustomerCode>
                           <get:BirthDate>?</get:BirthDate>
                           <get:VoucherID>?</get:VoucherID>
                           <get:HelpSmsFlag>?</get:HelpSmsFlag>
                           <get:MsAdminFlag>?</get:MsAdminFlag>
                           <get:CustomerType>?</get:CustomerType>
                           <get:ParentAccount>?</get:ParentAccount>
                           <get:SmeAdministratorFlag>?</get:SmeAdministratorFlag>
                           <get:SignatureAccount>?</get:SignatureAccount>
                           <get:ChallengeQuestion>?</get:ChallengeQuestion>
                           <get:ChallengeAnswer>?</get:ChallengeAnswer>
                           <get:PreferredContact>?</get:PreferredContact>
                           <get:Sponsor>?</get:Sponsor>
                           <get:ContractResponsible>?</get:ContractResponsible>
                           <get:DuDirectMarketing>?</get:DuDirectMarketing>
                           <get:WifiContract>?</get:WifiContract>
                           <get:PrgCode>?</get:PrgCode>
                           <get:WebPreferredLanguage>?</get:WebPreferredLanguage>
                           <get:TmpPassword>?</get:TmpPassword>
                           <get:AllowReceiveInformation>?</get:AllowReceiveInformation>
                           <get:Description>?</get:Description>
                           <get:Host>?</get:Host>
                           <get:L>?</get:L>
                           <get:O>?</get:O>
                           <get:Ou>?</get:Ou>
                           <get:SeeAlso>?</get:SeeAlso>
                        </get:Contracts>
                     </get:ContractsList>
                  </get:Customer>
               </get:CustomerList>
            </lcew:Body>
         </Response>
      </web:GetCustomerAndContractsResponse>
   </soapenv:Body>
</soapenv:Envelope>
